Revit 2015 API
FormatValueOptions Methods
The FormatValueOptions type exposes the following members.
Methods
Name | Description
AreValidForUnitType |  Obsolete.
 Checks whether the FormatOptions in this FormatValueOptions is valid for a given unit type.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace